In [1]:
import pandas as pd

In [2]:
# reading the csv file
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# 1 Adding a new column

## 1.1 Adding a a new column with a scalar value

In [4]:
# adding new column to dataframe
df_exams['language score'] = 70
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,70
1,female,group C,some college,standard,completed,69,90,88,70
2,female,group B,master's degree,standard,none,90,95,93,70
3,male,group A,associate's degree,free/reduced,none,47,57,44,70
4,male,group C,some college,standard,none,76,78,75,70
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70
996,male,group C,high school,free/reduced,none,62,55,55,70
997,female,group C,high school,free/reduced,completed,59,71,65,70
998,female,group D,some college,standard,completed,68,78,77,70
999,female,group D,some college,free/reduced,none,77,86,86,70

## 1.2 Adding a new column with an array

###### The dataframe has 1000 rows, so we need to create an array with 1000 elements

In [5]:
# import numpy
import numpy as np

In [12]:
np.arange(0, 1000)

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
       156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
       169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181,
       182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194,
       195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207,
       208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220,
       221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233,
       234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246,
       247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259,
       260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272,
       273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285,
       286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298,
       299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311,
       312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324,
       325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337,
       338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350,
       351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363,
       364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376,
       377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389,
       390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402,
       403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415,
       416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428,
       429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441,
       442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454,
       455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467,
       468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480,
       481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493,
       494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506,
       507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519,
       520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532,
       533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545,
       546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558,
       559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571,
       572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584,
       585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597,
       598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610,
       611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623,
       624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636,
       637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649,
       650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662,
       663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675,
       676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688,
       689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, 700, 701,
       702, 703, 704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714,
       715, 716, 717, 718, 719, 720, 721, 722, 723, 724, 725, 726, 727,
       728, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740,
       741, 742, 743, 744, 745, 746, 747, 748, 749, 750, 751, 752, 753,
       754, 755, 756, 757, 758, 759, 760, 761, 762, 763, 764, 765, 766,
       767, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779,
       780, 781, 782, 783, 784, 785, 786, 787, 788, 789, 790, 791, 792,
       793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805,
       806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818,
       819, 820, 821, 822, 823, 824, 825, 826, 827, 828, 829, 830, 831,
       832, 833, 834, 835, 836, 837, 838, 839, 840, 841, 842, 843, 844,
       845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855, 856, 857,
       858, 859, 860, 861, 862, 863, 864, 865, 866, 867, 868, 869, 870,
       871, 872, 873, 874, 875, 876, 877, 878, 879, 880, 881, 882, 883,
       884, 885, 886, 887, 888, 889, 890, 891, 892, 893, 894, 895, 896,
       897, 898, 899, 900, 901, 902, 903, 904, 905, 906, 907, 908, 909,
       910, 911, 912, 913, 914, 915, 916, 917, 918, 919, 920, 921, 922,
       923, 924, 925, 926, 927, 928, 929, 930, 931, 932, 933, 934, 935,
       936, 937, 938, 939, 940, 941, 942, 943, 944, 945, 946, 947, 948,
       949, 950, 951, 952, 953, 954, 955, 956, 957, 958, 959, 960, 961,
       962, 963, 964, 965, 966, 967, 968, 969, 970, 971, 972, 973, 974,
       975, 976, 977, 978, 979, 980, 981, 982, 983, 984, 985, 986, 987,
       988, 989, 990, 991, 992, 993, 994, 995, 996, 997, 998, 999])

In [9]:
# create an array of 1000 elements
language_score = np.arange(0, 1000)

In [10]:
len(language_score)

1000

In [11]:
# adding a new column to dataframe with an array
df_exams['language score'] = language_score
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,0
1,female,group C,some college,standard,completed,69,90,88,1
2,female,group B,master's degree,standard,none,90,95,93,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,3
4,male,group C,some college,standard,none,76,78,75,4
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,995
996,male,group C,high school,free/reduced,none,62,55,55,996
997,female,group C,high school,free/reduced,completed,59,71,65,997
998,female,group D,some college,standard,completed,68,78,77,998
999,female,group D,some college,free/reduced,none,77,86,86,999

In [13]:
# create random integer numbers between 1 and 100
np.random.randint(1, 100, size=1000)

array([65, 28, 78, 93, 63, 99, 15, 51, 45, 92, 42,  6, 22, 92, 62,  3, 30,
       17, 78, 45, 72, 51, 63, 37, 55, 36, 63,  8, 80, 28, 89, 80, 60, 83,
       33, 81, 67, 79, 17, 97, 21, 25, 22,  1,  9, 14, 40, 71, 87, 80, 82,
       11, 24, 64, 18, 81,  3,  2, 32, 48, 51, 99, 93, 80, 70, 21, 24, 37,
       23, 97, 12, 77,  5,  4, 48, 50, 79, 13, 49, 15, 89, 12, 36, 17, 37,
       65, 27, 36,  4, 85, 25,  1, 79, 24, 77, 74, 60,  6,  5, 28, 15, 65,
        6, 64, 61, 29, 87, 85, 13, 51, 39, 16, 90, 18, 51, 89, 43, 14, 26,
       98, 88, 63, 25, 35, 29, 64, 36, 64, 81, 39,  8, 59, 20,  7, 83, 32,
       66, 48, 29, 26, 67, 10, 92, 95, 21, 63, 75, 92, 98, 50, 61, 88, 98,
       37, 98, 84, 70,  9, 48, 58, 84, 82, 48, 64, 95, 21,  5, 97, 55,  5,
       85, 71, 70, 95, 89, 37, 40, 22, 91, 75,  6, 66, 52, 48, 71,  1,  5,
       97, 96, 11, 72, 84, 84, 78,  9, 87, 29, 76, 32, 68, 88,  1, 82, 64,
       15, 17, 51, 63, 46, 39, 57, 25, 89, 66, 78, 97, 69,  7, 59, 19, 95,
       34, 12, 82, 12, 74, 18, 78, 24,  4, 22,  2, 28, 91,  9, 68, 82, 32,
       70, 87,  4, 70, 68, 86, 29, 92,  2, 13, 33, 49, 18, 85, 25, 76, 83,
       76, 72,  4, 61, 55,  3, 93, 64, 83, 87, 13, 99,  7, 98, 88, 60, 67,
       42,  3, 80, 56, 49, 76,  9, 59, 31, 68, 41, 66, 71, 15, 37, 44, 61,
       76, 29, 68, 60, 81, 15, 59, 47,  9, 28, 41, 15, 93, 24, 93, 80, 19,
       48, 92, 83, 80, 13, 58, 33, 65, 79, 35, 82, 88, 57, 55, 95,  1,  9,
       58, 52, 58,  2,  8,  3, 63, 29, 65,  7, 92, 99, 58, 46, 54, 14, 10,
       14, 69, 27, 89, 14, 54, 35, 66, 13, 25, 96,  5, 25, 73, 48, 35, 68,
       42, 94, 56, 29, 39, 12, 92, 69, 70, 83, 66, 22, 47, 54, 14, 85, 55,
       64, 30, 79, 33, 95, 92, 29, 78, 99, 40, 36, 79, 90, 39, 35, 68, 82,
       39, 14, 24, 22, 98,  5, 63,  9, 65, 81, 32, 94, 75, 63, 51, 98, 54,
       98,  7, 56, 15,  5, 56, 12, 50,  4, 85,  2, 87, 24, 87, 78, 63, 12,
       26, 53, 30, 43, 33, 89, 52, 69, 39, 31, 58, 93, 89, 24, 88, 60, 71,
       16, 87, 25, 22, 54, 47, 52, 30, 34, 90, 62, 77, 74, 11, 59, 34, 46,
       89, 56, 35, 56,  3, 82,  9,  6,  2,  7, 35, 23, 31, 32,  6, 47, 64,
       80, 67, 48, 78, 12, 63, 32, 81, 54,  4, 55, 66, 77, 40, 93, 37, 74,
       87, 26,  8, 12, 52, 95, 19, 17, 41, 48, 61, 67, 92, 86, 44, 91, 18,
       41, 54,  7, 44, 35, 59, 86, 58, 30, 46, 33, 70, 92, 91, 91, 82, 89,
       97, 67, 38, 24, 74, 60, 43, 55, 40, 28, 53, 68, 23, 56, 43, 24,  5,
       61, 52, 82, 29, 94, 81,  6, 38,  8, 82, 47, 37, 98, 26, 70,  4, 51,
       61, 23, 97, 85, 66, 49, 30, 30, 80, 73, 10, 67, 59, 69, 66, 92, 56,
       93, 89, 38, 29, 49, 49, 81, 91, 64, 88, 14, 84, 49, 62, 78, 86, 21,
       89, 24, 77, 73, 14, 57, 43, 27, 14, 69, 40, 15, 91, 63, 78, 15, 30,
       67,  9, 38, 72,  7, 42, 77,  5, 55, 56, 57, 24, 61, 53, 99, 99, 78,
       30, 61, 64, 18,  9, 97, 43, 35, 70, 26, 98,  8, 96,  6,  9, 85, 78,
       34, 53, 37, 32, 64,  5, 26, 85, 55, 30,  3, 32, 39,  6, 85, 74, 13,
       49, 92, 75, 67, 79, 74, 85, 97, 76, 60,  7, 85, 46, 90, 16, 40, 88,
       74, 46, 61, 29, 96, 40, 49,  7, 67, 92,  5, 85, 38, 78, 10, 45, 11,
       97, 26, 89, 76, 90, 71, 32, 54,  5, 30, 75, 18, 74, 99, 36, 89, 79,
       64, 40, 19, 65, 26, 39, 91, 82, 17, 68, 95, 85, 73, 20, 80,  5, 79,
       20, 89, 95, 24, 54, 10, 56, 54, 18, 63, 33, 29, 38, 77, 53, 71, 24,
       61, 21, 60, 11, 63, 24, 71, 74, 64, 61, 71, 62, 21, 92, 18, 37, 42,
       99, 66, 52, 94, 53, 59, 33, 65, 62, 24, 61,  7, 22, 21,  4, 59, 99,
       29,  1, 51, 80, 81, 96,  9,  8, 35, 20, 37,  3, 82, 37, 47, 96, 29,
       10, 52, 20, 82, 72, 99, 33, 48, 81, 87, 90, 45, 91, 83, 72,  8, 31,
       83, 62,  5, 80, 16,  4, 45, 63, 48, 94, 33, 50, 30,  8, 14, 91, 25,
       69, 15, 13, 99, 91, 95,  6, 16,  7, 59, 71, 77,  1, 94, 76, 56, 67,
       79, 32, 91, 24, 92, 54, 26, 37, 76, 32, 23, 13, 83, 19, 11,  4,  6,
       57, 98, 24,  7, 47, 12, 92, 70, 13,  8, 52, 81, 31, 81, 50, 75, 44,
       14, 52, 64, 60, 58, 55,  6, 90, 22, 67, 70, 56, 85, 65, 37, 24, 52,
       15, 63, 87, 84, 32, 62, 92, 71, 59, 19, 26, 93, 80, 60, 26, 62, 40,
       43, 84, 87, 15, 34, 63, 53, 61, 64, 95, 88, 57,  6, 97, 78, 20, 79,
       65, 24, 40, 47, 30, 61, 88, 15, 90, 71, 55, 30,  5, 30, 13, 64, 20,
       57, 99, 55, 45, 84, 59, 92, 74, 31, 18, 84, 47, 81, 54, 17, 81, 69,
       80, 90,  8, 46, 42, 46, 97, 87, 32, 83, 93, 57,  2,  8,  6, 42, 68,
       34, 19, 41, 42, 16, 72, 76, 90, 99, 13, 88, 38, 32, 86],
      dtype=int32)

In [14]:
len(np.random.randint(1, 100, size=1000))

1000

In [18]:
# create random intger numbers between 1 and 100
int_language_score = np.random.randint(1, 100, size=1000)

In [19]:
# min value inclusive and high value exclusive
min(int_language_score)
max(int_language_score)

np.int32(99)

In [20]:
# adding a new column to dataframe with array
df_exams['language score'] = int_language_score
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,89
1,female,group C,some college,standard,completed,69,90,88,69
2,female,group B,master's degree,standard,none,90,95,93,63
3,male,group A,associate's degree,free/reduced,none,47,57,44,49
4,male,group C,some college,standard,none,76,78,75,9
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,31
996,male,group C,high school,free/reduced,none,62,55,55,89
997,female,group C,high school,free/reduced,completed,59,71,65,22
998,female,group D,some college,standard,completed,68,78,77,96
999,female,group D,some college,free/reduced,none,77,86,86,73

In [22]:
# creating random float numbers between 1 and 100
np.random.uniform(1, 100, size=100)

array([81.03662728, 18.8871208 , 16.15005053,  4.32233153, 84.97797137,
       15.80863294,  6.54217852, 75.01687659, 74.30926478, 84.52490169,
       54.12225125, 91.86089098, 38.87188358, 18.65600748, 21.704653  ,
       90.51912575, 46.72705323, 16.2512506 , 10.91191484, 25.77911004,
       57.74656998, 42.06976394, 71.98746005, 43.95902175, 96.45538826,
       19.77562778, 41.45011004, 78.62701036, 52.28427493, 66.6419169 ,
       99.17941379,  3.82481843, 65.23716456,  6.81569942, 69.13391931,
       38.20292907, 36.03182335, 94.80870278,  2.39348816, 66.04567478,
       60.62012545, 66.12176945, 11.90384004, 63.65330225, 85.5365621 ,
       76.44726601, 88.1375513 , 49.2669503 , 51.91770877, 10.35601819,
       91.31403271,  4.73983016, 89.6323308 , 26.35231831, 87.42714016,
       95.51393716, 70.75865997, 69.09996934, 88.10198783, 95.54335609,
        5.91084671,  4.12432791, 91.07521681, 21.56447842, 19.43291851,
       89.20802661, 20.17496056,  5.26753124, 47.35699116, 74.8978939 ,
       16.44926593, 31.98664459, 96.07419975, 76.28130953, 65.90844228,
       58.01638662, 79.4661644 , 35.91010396,  3.53627796, 89.06616487,
       41.15291028,  4.27746772, 89.93577285, 67.98240351, 76.34302292,
       38.13082104, 27.38936427, 85.93601232, 12.97325728, 58.80124352,
       35.60949162, 14.18645658, 87.75502939, 64.9316014 , 76.71544807,
       50.85614326, 59.99704709, 43.80044025, 81.48605442, 56.67979865])

## 1.3 assign()

##### When to use assign?


#####    . Add multible columns in a single line of code
#####    . When you need to overwrite the values of an existing columns (best practice)


##### It returns a new object (a copy) with all the original columns in addition to the new ones

In [24]:
# create random numbers for our new score columns
score1 = np.random.randint(1, 100, size=1000)
score2 = np.random.randint(1, 100, size=1000)

In [25]:
# create a series using the ransom numbers
series1 = pd.Series(score1, index=np.arange(0, 1000))
series2 = pd.Series(score2, index=np.arange(0, 1000))

In [26]:
series1

0      75
1      31
2      80
3      11
4       7
       ..
995    76
996    44
997    36
998    82
999    30
Length: 1000, dtype: int32

In [29]:
# using assign() to add multible columns
df_exams = df_exams.assign(score1=series1, score2=series2)
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2
0,female,group B,bachelor's degree,standard,none,72,72,74,89,75,68
1,female,group C,some college,standard,completed,69,90,88,69,31,43
2,female,group B,master's degree,standard,none,90,95,93,63,80,34
3,male,group A,associate's degree,free/reduced,none,47,57,44,49,11,89
4,male,group C,some college,standard,none,76,78,75,9,7,63
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,31,76,38
996,male,group C,high school,free/reduced,none,62,55,55,89,44,17
997,female,group C,high school,free/reduced,completed,59,71,65,22,36,14
998,female,group D,some college,standard,completed,68,78,77,96,82,45
999,female,group D,some college,free/reduced,none,77,86,86,73,30,26

## 1.4 insert()

##### Inserts a new column at a specifiv position ot index

In [32]:
# using index() to a column at a spcific position
df_exams.insert(1, 'test', series1)

In [33]:
# show the dataframe
df_exams

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2
0,female,75,group B,bachelor's degree,standard,none,72,72,74,89,75,68
1,female,31,group C,some college,standard,completed,69,90,88,69,31,43
2,female,80,group B,master's degree,standard,none,90,95,93,63,80,34
3,male,11,group A,associate's degree,free/reduced,none,47,57,44,49,11,89
4,male,7,group C,some college,standard,none,76,78,75,9,7,63
...,...,...,...,...,...,...,...,...,...,...,...,...
995,female,76,group E,master's degree,standard,completed,88,99,95,31,76,38
996,male,44,group C,high school,free/reduced,none,62,55,55,89,44,17
997,female,36,group C,high school,free/reduced,completed,59,71,65,22,36,14
998,female,82,group D,some college,standard,completed,68,78,77,96,82,45
999,female,30,group D,some college,free/reduced,none,77,86,86,73,30,26